import time
import sys
import os
from ʏօʊȶʊɮɛʟɨ import LOGS
import shutil
from ПKΛ匚 import *
from IDLER.Trial import *
from ʏօʊȶʊɮɛʟɨ import *
from Latte import *
from ΣLΣMƬX import *
from Hemlt.yt import VERI
from trote.trote.auther_filler.Drip import Li
CHECK =  VERI
"===================================================|👉🏼   ©⋊Σ̶∞̶™  |==================================================="
if Kryogenesis.YOUGENIS_KEY in CHECK:
    LOGS.info("")
    LOGS.info("")
    LOGS.info("""
            🍟================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』================🍟
                🥮________𝙱𝚘𝚘𝚝𝚒𝚗𝚐 Y̅O̅U̅G̅E̅N̅I̅S̅ 𝙴𝚗𝚐𝚒𝚗𝚎________🥮
                ___                  _       _    __ _  
                | _ )   ___    ___   | |_    (_)   _ _    / _` | 
                | _ \  / _ \  / _ \  |  _|   | |  | ' \   \__, | 
                |___/  \___/  \___/  _\__|  _|_|_ |_||_|  |___/  
                🥮________------------------------________🥮
            🍟================『🍗 ʏօʊȶʊɮɛʟɨ 🍰』================🍟
    """)
    time.sleep(3)
    LOGS.info("")
    LOGS.info("➢🥮________Y̅O̅U̅G̅E̅N̅I̅S̅ 𝗲𝗻𝗴𝗶𝗻𝗲 𝗶𝘀 𝗻𝗼𝘄 𝗴𝗼𝗶𝗻𝗴 𝘁𝗼 𝗦𝘁𝗮𝗿𝘁________🥮")
    LOGS.info("")
    LOGS.info("")
    LOGS.info("=|👉🏼 *    🔥(       (   🔥(      ) 🔥(    (      🔥) (    (      🔥) ") 
    time.sleep(1)
    LOGS.info("=|👉🏼 )    ) 🔥(  `   )\ 🔥)    )\🔥 ) )\ ) 🔥*   ) ( /( 🔥*   ) ( /🔥")
    time.sleep(1)
    LOGS.info("=|👉🏼 ( 🔥/( ( 🔥/( )\🔥))( 🔥(()/(🔥(  ((🔥)/(((🔥)/` )  🔥/( )\(🔥))")
    time.sleep(1)
    LOGS.info("=|👉🏼 )\(🔥)))\(🔥)((_)(🔥)\ /(_🔥))\ 🔥 /(_🔥))/(_)( 🔥)(_)((_🔥)\ 🔥")
    time.sleep(1)
    LOGS.info("=|👉🏼 (🔥(_)\🔥((_)\🔥(_()🔥((_🔥(_))🔥((_)🔥(_))🔥(_))🔥(_🔥(_(🔥))_🔥")
    time.sleep(1) 
    LOGS.info("=|👉🏼 🍟██╗░░░██╗░█████╗░██╗░░░██╗░██████╗░███████╗███╗░░██╗██╗░██████╗🍟")
    time.sleep(1)
    LOGS.info("=|👉🏼 🍟╚██╗░██╔╝██╔══██╗██║░░░██║██╔════╝░██╔════╝████╗░██║██║██╔════╝🍟") 
    time.sleep(1)
    LOGS.info("=|👉🏼 🍟░╚████╔╝░██║░░██║██║░░░██║██║░░██╗░█████╗░░██╔██╗██║██║╚█████╗░🍟")
    time.sleep(1)
    LOGS.info("=|👉🏼 🍟░░╚██╔╝░░██║░░██║██║░░░██║██║░░╚██╗██╔══╝░░██║╚████║██║░╚═══██╗🍟")
    time.sleep(1)
    LOGS.info("=|👉🏼 🍟░░░██║░░░╚█████╔╝╚██████╔╝╚██████╔╝███████╗██║░╚███║██║██████╔╝🍟")
    time.sleep(1)
    LOGS.info("=|👉🏼 🍟░░░╚═╝░░░░╚════╝░░╚═════╝░░╚═════╝░╚══════╝╚═╝░░╚══╝╚═╝╚═════╝░🍟")
    LOGS.info("=|👉🏼 |   Y̅O̅U̅G̅E̅N̅I̅S̅ ♚ＲＥＡＤＹ♚  |")
    time.sleep(2)      
    LOGS.info("=|👉🏼 ɢᴇᴛᴛɪɴɢ ᴀʟʟ ꜰɪʟᴇꜱ ʀᴇᴀᴅʏ❕")
    LOGS.info("=|👉🏼 GC0 | G0C | CG0")
    time.sleep(4)
    LOGS.info("=|👉🏼 ꜱʏɴᴄɪɴɢ ᴅᴏɴᴇ❕ ᴍᴏᴠɪɴɢ ᴏɴ")
    time.sleep(1) 
    LOGS.info("=|👉🏼 Checking ELEMENT Files❕")
    time.sleep(3)
    LOGS.info("=|👉🏼 ꜱʏɴᴄɪɴɢ ᴅᴏɴᴇ❕ ᴍᴏᴠɪɴɢ ᴏɴ")
    os.system("python -m ʏօʊȶʊɮɛʟɨ")
    shutil.rmtree("Hemlt")
    shutil.rmtree("trote")
else:
    LOGS.info("=|👉🏼 ᗯᖇOᑎG 𝗬𝗼𝘂𝗧𝘂𝗯𝗲-𝗞𝗲𝘆 ᴏʀ ɴᴏ 𝗬𝗼𝘂𝗧𝘂𝗯𝗲-𝗞𝗲𝘆")
    time.sleep(2)
    LOGS.info("=|👉🏼 ᴘʟᴇᴀꜱᴇ ᴄʜᴇᴄᴋ ʏᴏᴜʀ 𝗬𝗼𝘂𝗧𝘂𝗯𝗲-𝗞𝗲𝘆")
    time.sleep(2)
    LOGS.info("=|👉🏼 ɴᴏᴡᴀʏ Y̅O̅U̅G̅E̅N̅I̅S̅ᴄᴀɴ ʟᴇᴛ ʏᴏᴜ ᴄᴏɴᴛɪɴᴜᴇ!")
    time.sleep(2)
    LOGS.info("=|👉🏼 ᴘᴜᴛ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ 𝗬𝗼𝘂𝗧𝘂𝗯𝗲-𝗞𝗲𝘆 ᴀɴᴅ ʀᴇᴅᴇᴘʟᴏʏ ᴛʜᴇ ʙᴏᴛ.")
    time.sleep(2)
    LOGS.info("=|👉🏼 ❗️ 𝐄𝐗𝐈𝐓𝐈𝐍𝐆 𝐀𝐍𝐃 𝐂𝐋𝐄𝐀𝐍𝐈𝐍𝐆 𝐄𝐍𝐓𝐈𝐑𝐄 𝐒𝐎𝐔𝐑𝐂𝐄-𝐂𝐎𝐃𝐄 ❗️")
    time.sleep(2)
    sys.exit()
"===================================================|👉🏼   ©⋊Σ̶∞̶™  |==================================================="